Revit 2027 API
BuiltInFailures.FabricFailures.MajorOverhangFailure Property
 At least one of the overhangs in the major direction is lower than radius of the wire in the minor direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MajorOverhangFailure { get; }
Public Shared ReadOnly Property MajorOverhangFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MajorOverhangFailure {
	FailureDefinitionId^ get ();
}
static member MajorOverhangFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace